<font size="6"><strong>Career Booster Python & Data Science</font></strong><br /><br />
<font size="6">Session 2</font><br /><br />

Cette session est dédiée à l'import d'un jeu de données ainsi qu'à la visualisation et l'analyse préliminaires de son contenu.

In [1]:
# --- Imports de bibliothèques
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Nous allons importer un jeu de données couramment utilisé en Data Science : le dataset "titanic-passengers".

In [2]:
path_to_file = "../data/titanic-passengers.csv"

In [3]:
# --- Import des données via la bibliothèque pandas
df = pd.read_csv(path_to_file)
df

                           PassengerId;Survived;Pclass;Name;Sex;Age;SibSp;Parch;Ticket;Fare;Cabin;Embarked
343;No;2;Collander               Mr. Erik Gustaf;male;28.0;0;0;248740;13.0;;S
76;No;3;Moen                 Mr. Sigurd Hansen;male;25.0;0;0;348123;7.65;F...
641;No;3;Jensen              Mr. Hans Peder;male;20.0;0;0;350050;7.8542000...
568;No;3;Palsson             Mrs. Nils (Alma Cornelia Berglund);female;29....
672;No;1;Davidson            Mr. Thornton;male;31.0;1;0;F.C. 12750;52.0;B71;S
...                                                                       ...
779;No;3;Kilgannon                     Mr. Thomas J;male;;0;0;36865;7.7375;;Q
435;No;1;Silvey              Mr. William Baird;male;50.0;1;0;13507;55.9;E44;S
342;Yes;1;Fortune            Miss. Alice Elizabeth;female;24.0;3;2;19950;2...
633;Yes;1;Stahelin-Maeglin             Dr. Max;male;32.0;0;0;13214;30.5;B50;C
111;No;1;Porter              Mr. Walter Chamberlain;male;47.0;0;0;110465;5...

[891 rows x 1 columns]

In [8]:
# df pour DataFrame
df = pd.read_csv(path_to_file, sep=";")

In [9]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,343,No,2,"Collander, Mr. Erik Gustaf",male,28.0,0,0,248740,13.0000,NaN,S
1,76,No,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
2,641,No,3,"Jensen, Mr. Hans Peder",male,20.0,0,0,350050,7.8542,NaN,S
3,568,No,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S
4,672,No,1,"Davidson, Mr. Thornton",male,31.0,1,0,F.C. 12750,52.0000,B71,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,779,No,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
887,435,No,1,"Silvey, Mr. William Baird",male,50.0,1,0,13507,55.9000,E44,S
888,342,Yes,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
889,633,Yes,1,"Stahelin-Maeglin, Dr. Max",male,32.0,0,0,13214,30.5000,B50,C
890,111,No,1,"Porter, Mr. Walter Chamberlain",male,47.0,0,0,110465,52.0000,C110,S

In [19]:
# --- Pour voir les premières lignes du dataset (par défaut, les 5 premières)
df.head()
#df.head(10)

# --- Pour voir les dernières lignes du dataset (par défaut, les 5 dernières)
#df.tail()
#df.tail(10)

# --- Pour voir des lignes prises aléatoirement dans le dataset (par défaut, 1 seule ligne)
#df.sample()
#df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,343,No,2,"Collander, Mr. Erik Gustaf",male,28.0,0,0,248740,13.0000,NaN,S
1,76,No,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
2,641,No,3,"Jensen, Mr. Hans Peder",male,20.0,0,0,350050,7.8542,NaN,S
3,568,No,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S
4,672,No,1,"Davidson, Mr. Thornton",male,31.0,1,0,F.C. 12750,52.0000,B71,S

In [ ]:
# --- Pour obtenir la liste des colonnes du dataset. Utile pour les datasets volumineux
df.columns

In [ ]:
plt.plot(df["Age"])

In [ ]:
plt.plot(df["Fare"])

In [ ]:
# --- Représenter l'âge en fonction du prix du ticket acheté
plt.plot(df["Age"], df["Fare"])

Ca ne fonctionne pas. Pour cela, il faut utiliser un "scatter plot".

In [ ]:
plt.scatter(df["Age"], df["Fare"], s=10)
plt.xlabel("Age");
plt.ylabel("Fare");

# --- En utilisant la bibliothèque seaborn
# sns.scatterplot(df["Age"], df["Fare"])

In [ ]:
sns.relplot(x="Age", y="Fare", hue="Sex", style="Survived", data=df);

Le scatter plot est très utile pour déterminer une corrélation entre des variables :

In [ ]:
var1 = [1, 2, 3, 4, 5, 6, 7]
var2 = [10, 20, 30, 40, 50, 60, 70]
plt.scatter(var1, var2)

Et ici un exemple plus proche de la réalité :

In [ ]:
from scipy.linalg import cholesky
from scipy.stats import norm

with open('../data/correlated_variables.npy', 'rb') as file:
    data = np.load(file)

# Plot various projections of the samples.
plt.subplot(2,2,1)
plt.plot(data[0], data[1], 'b.')
plt.ylabel('y[1]')
plt.axis('equal')
plt.grid(True)

plt.subplot(2,2,3)
plt.plot(data[0], data[2], 'b.')
plt.xlabel('y[0]')
plt.ylabel('y[2]')
plt.axis('equal')
plt.grid(True)

plt.subplot(2,2,4)
plt.plot(data[1], data[2], 'b.')
plt.xlabel('y[1]')
plt.axis('equal')
plt.grid(True)

### Boxplot

Il est souvent utile de visualiser certaines données sous forme de "boxplot". Cette représentation permet d'étudier la façon dont les données sont distribuées.

Un boxplot nous informe sur 5 valeurs clés :
- le minimum
- le maximum
- le 1er quartile (Q1, i.e. 25% des données)
- le 2è quartile, plus connu sous le nom de <i>médiane</i> (Q2, i.e. 50% des données)
- le 3è quartile (Q3, i.e. 75% des données)

Mais en plus de cela, le boxplot (et l'analyse qui conduit à cette représentation) nous informe sur de potentielles valeurs aberrantes (ou <i>outliers</i>), c'est-à-dire des valeurs qui a priori seraient des erreurs (beaucoup trop élevées ou trop basses).
Evidemment, c'est le contexte qui permet aussi de juger si des valeurs extrêmes peuvent exister ou non.

In [ ]:
df.boxplot(column=["Age"])

Dans le cas de la variable <b>Age</b> étudiée ci-dessus, nous voyons que :
- le minimum est de quasiment 0
- le maximum est à environ 80
- Q1 = 20
- Q2 = ~28
- Q3 = ~38

Nous voyons aussi que les valeurs au-dessus de ~65 sont considérées comme des valeurs aberrantes. Dans le cas d'une variable d'âge, il est <i>a priori</i> évident qu'il ne s'agit pas de valeurs aberrantes.

In [ ]:
# --- Et pour avoir les valeurs exactes ayant permis de construire le boxplot :
df["Age"].describe()

In [ ]:
df.boxplot(column=["Fare"])

### Valeurs manquantes

In [ ]:
df["Age"].head(10)

In [ ]:
df["Age"].isnull()

In [ ]:
bool_series = pd.isnull(df["Age"])  
    
# filtering data  
# displaying data only with Gender = NaN  
df[bool_series]

In [ ]:
df.fillna(0)

In [ ]:
df["Age"].fillna("No Age")

Ci-dessous un exemple de jeu de données contenant des zones entières de valeurs manquantes.

Pour des jeux de données pas trop volumineux, il est très utile d'utiliser une "heatmap" pour repérer facilement d'éventuels patterns et ainsi les traiter spécifiquement.

In [ ]:
df_missing = pd.read_csv('../data/missing_values.csv')
df_missing.head()

In [ ]:
plt.figure(figsize=(18, 9))
sns.heatmap(df_missing.isnull(), cbar=False)
plt.show()

***
De retour à notre jeu de données :

In [ ]:
plt.figure(figsize=(18, 9))
sns.heatmap(df.isnull(), cbar=False)
plt.show()

Il existe de nombreuses manières de remplacer des valeurs manquantes. Toutes dépendent du contexte.


Il arrive souvent qu'on remplace les valeurs manquantes par :
- la moyenne de la variable
- la médiane de la variable

Chacune de ces approches a un impact différent sur la variable : la première ne modifie pas la moyenne tandis que la seconde la modifie. En revanche, la seconde méthode est insensible aux valeurs extrêmes alors que la première l'est grandement.

In [ ]:
np.mean(df["Age"])

In [ ]:
df["Age_filled_mean"] = df["Age"].fillna(np.mean(df["Age"]))

In [ ]:
df[["Age", "Age_filled_mean"]]

In [ ]:
np.mean(df["Age_filled_mean"])

In [ ]:
df["Age_filled_median"] = df["Age"].fillna(np.nanmedian(df["Age"]))

In [ ]:
np.mean(df["Age_filled_median"])

***
Mais comment faire pour une variable non numérique, comme la colonne "Embarked" ?

Une solution est d'assigner la valeur la plus présente afin de ne pas introduire une valeur peut-être extrême / aberrante au sein du jeu de données.

Une autre solution est d'assigner une valeur aléatoire.

In [ ]:
values, counts = np.unique(df["Embarked"], return_counts=True)
plt.bar(values, counts);

In [ ]:
df["Embarked"].fillna("S", inplace=True)

***
### Transformation de variables catégorielles en valeurs numériques

In [ ]:
from sklearn.preprocessing import LabelEncoder

lb_make = LabelEncoder()
df["Sex_num"] = lb_make.fit_transform(df["Sex"])

In [ ]:
df[["Sex_num", "Sex"]].head(10)

In [ ]:
lb_make = LabelEncoder()
df["Survived_num"] = lb_make.fit_transform(df["Survived"])

In [ ]:
df[["Survived_num", "Survived"]].head(10)

In [ ]:
lb_make = LabelEncoder()
df["Embarked_num"] = lb_make.fit_transform(df["Embarked"])

In [ ]:
df

In [ ]:
plt.figure(figsize=(18, 9))
sns.heatmap(df.isnull(), cbar=False)
plt.show()